---
kind: method
id: M:Autodesk.Revit.DB.Transform.#ctor(Autodesk.Revit.DB.Transform)
zh: 变换
source: html/5ad3cfba-926d-26ef-9dd0-02c8acb2c854.htm
---
# Autodesk.Revit.DB.Transform.#ctor Method

**中文**: 变换

The copy constructor.

## Syntax (C#)
```csharp
public Transform(
	Transform source
)
```

## Parameters
- **source** (`Autodesk.Revit.DB.Transform`)